{
  "architectures": ["TinyForCausalLM"],
  "hidden_size": 16,
  "max_position_embeddings": 64,
  "model_type": "tiny-qwen",
  "num_attention_heads": 4,
  "num_hidden_layers": 2,
  "num_key_value_heads": 2,
  "quantization_config": {
    "activation_scheme": "dynamic",
    "fmt": "e4m3",
    "quant_method": "fp8",
    "weight_block_size": [128, 128]
  },
  "torch_dtype": "bfloat16",
  "vocab_size": 32
}
