{
  "chat_template": "{{ '<|im_start|>user\\n' + messages[0]['content'] + '<|im_end|>' }}",
  "eos_token": "<|im_end|>",
  "model_max_length": 128,
  "pad_token": "<|endoftext|>",
  "tokenizer_class": "TinyTokenizer"
}
